import { one } from './1000'
import { two } from './2000'
import { three } from './3000'
import { four } from './4000'


const rawIntoReady = (array) => {
  const newarray = []
  array.map(item => {
    const obj = {
      eng : item[0],
      //cause some korean words can't be rendered in useState , so this is needed, i am proud
      korean: item[1]+" ",
      //add group : normal to normal words
      group : item[2]?item[2]:"normal",
    }

   newarray.push(obj)
  })
  return newarray
}

const raw = [...one, ...two , ...three , ...four ]

export const items = rawIntoReady(raw)


/*
const rawIntoReady = (array) => {
  const newarray = []
  array.map(item => {
    const obj = {
      eng : item[0],
      korean: item[1],
    }
   newarray.push(obj)
  })
  return newarray
}


 const raw = [...one, ...two, ...three ]
*/

 /* 
const Grammer = [
  ["၏/ရဲ့","의"],
  ['ဖြစ်ပါတယ်','N+입니다'],
  ['ဖြစ်ပါသလား','N+입니까'],
  ['ကတော့/သော','N+은/는'],
  ['က','N+이/가'],
  ['ပါတယ်','V+.ㅂ니다/습니다'],
  ['ပါသလား','V+.ㅂ니까/습니까'],
  ['ကို','N+을/를'],
  ['ကို','N+에(가다,오다)'],
  ['မှာ','N+에서'],
  ['မှာ','N+에(있다,계시다,없다,살다,많다,앉다)'],
  ['and','N+와/과'],
  ['and','N+하고'],
  ['and','N+랑/이랑'],
  ['and','N+및'],
  ['ကြမလား/ရမလား','V+을까요/.ㄹ까요'],
  ['မဘူး','V+지못합니다'],
  ['မဘူး','V+지않습니다'],
  ['ချင်တယ်','V+고싶습니다'],
  ['ပါ','V+세요/으세요'],
  ['ပါ','V+십시오/으십시오'],
  ['နေပါတယ်/ထားပါတယ်','V+고있습니다'],
  ['မလို့ပါ','V+려고합니다/으려고합니다'],
  ['ရင်/လျှင်','V+면/으면'],
  ['ချင်ရင်','V+려면/으려면'],
  ['ရင်းနဲ့','V+면서/으면서'],
  ['သောအခါ/တဲ့အခါ','V+을때/.ㄹ때'],
  ['လည်းပဲ','N+도'],
  ['ပြီးတော့','V+고'],
  ['အစ','N+부터'],
  ['အထိ','N+까지'],
  ['မဘူး','안+V'],
  ['ပြီးတော့/သောကြောင့်','V+(아,어,해)서'],
  ['ဖြင့်/နဲ့/သို့','V+로/으로'],
  ['သော','V+는'],
  ['ခဲ့သော','V+은/ㄴ'],
  ['လုပ်ကြည့်သည်',' V+(아,어,해)보다/보여요'],
  ['လုပ်ပေးသည်း','V+(아,어,해)주다'],
  ['မယ့်','V+(을/ㄹ)'],
  ['ခဲ့တယ်','V+(았,었,했)어요/습니다'],
  ['လိမ့်မယ်','V+을/ㄹ 거예요'],
  ['မလို့ပါ','V+려/으려 고해요'],
  ['တဲ့အတွက်ကြောင့်', 'V+기때문에'],
  ['ဘာဖြစ်ပါသလဲ','뭐여요'],
  ['ပါတယ် / ပေမယ့်', 'V+는데'],
  ['လုပ်ရမယ်','V+(아,어,해)야해요'],
  ['လုပ်နိုင်တယ်','V+을/ㄹ 수있다'],
  ['လုပ်မနိုင်ပါ','V+을/ㄹ 수없다'],
  ['ယဥ်ကျေး','V+시다/으시다'],
  ['ဆိုတာ','V+는지'],
  ['ပြီးတော့/သောကြောင့်','V+니까/으니까'],
  ['မဟုတ်လား','N+지요/이지요'],
  ['ဖြစ်ဖြစ်/သို့မဟုတ်','N+나/이나'],
  
  ]
  */
   




  